Repository: Kadshubham1/rudra
Catalog: locale/*/LC_MESSAGES/django.po
Languages: hi, mr

source: Hindi
hi: हिन्दी

source: Marathi
hi: मराठी

source: Appointment
hi: अपॉइंटमेंट

source: Our Blog
hi: हमारा ब्लॉग

source: A condition where there is abnormal spacing between vertebrae in the spine, which can cause pain and discomfort.
hi: एक स्थिति जहां रीढ़ की हड्डी में कशेरुकाओं के बीच असामान्य अंतर होता है, जो दर्द और तकलीफ का कारण बन सकता है।

source: A condition where bones have unusual spacing or alignment, potentially causing mobility issues and pain.
hi: एक स्थिति जहां हड्डियों में असामान्य अंतर या संरेखण होता है, जो गतिशीलता की समस्याएं और दर्द पैदा कर सकता है।

source: Discomfort or pain in the knee joint that can affect movement and daily activities.
hi: घुटने के जोड़ में तकलीफ या दर्द जो चलने-फिरने और दैनिक गतिविधियों को प्रभावित कर सकता है।

source: Joint Inflammation
hi: जोड़ों में सूजन

source: Our Privacy Policy explains how we collect, use, and protect your personal information.
hi: हमारी गोपनीयता नीति बताती है कि हम आपकी व्यक्तिगत जानकारी को कैसे एकत्र, उपयोग और सुरक्षित करते हैं।

source: Please read our Terms & Conditions carefully before using our services.
hi: कृपया हमारी सेवाओं का उपयोग करने से पहले हमारे नियम और शर्तें ध्यान से पढ़ें।

source: Stay updated with our latest articles, health tips, and news.
hi: हमारे नवीनतम लेख, स्वास्थ्य टिप्स और समाचारों से अपडेट रहें।

source: Tingling in the hands can often be addressed with the right massage techniques. It is often described as pins and needles or numbness and can be caused as it is commonly related to muscle tension, nerve compression, or poor circulation.
hi: हाथों में झनझनाहट अक्सर सही मालिश तकनीकों से संबोधित की जा सकती है। इसे अक्सर पिन और सुइयों या सुन्नता के रूप में वर्णित किया जाता है और यह आमतौर पर मांसपेशियों के तनाव, नसों के संकुचन, या खराब रक्त संचार से संबंधित हो सकता है।
